{"pages":[{"title":"ABOUT","text":"折木太郎BUPT 人工智能本科生爱好是打游戏和看动漫BiliBili steam 大伙不嫌弃可以加一下梦想是摆烂和环游世界现在努力学习，说不定将来某一天真能实现梦想！白日梦想家（好想定居北欧啊 😭）","link":"/about/index.html"},{"title":"LINKS","text":"放一些神的链接，用来激励自己学习Sarlren龙渊xqmmcqsAppletree24","link":"/links/index.html"}],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2023/03/07/hello-world/"},{"title":"test_my_site","text":"","link":"/2023/03/07/test-my-site/"},{"title":"Galaxy-II as an Architecture for Spoken Dialogue Evaluation","text":"作者：Joseph Polifroni and Stephanie SeneffAbstract这篇论文的摘要介绍了 GALAXY-II 架构，它由一个集中式中心枢纽和一组人类语言技术服务器组成，既提供了实现系统的有用工具，也提供了配置这些系统评估的简化方式。该论文还提出了两个新指标，用于自动评估口语对话系统的话语和对话组件，分别称为“用户挫败感”和“信息比特率”。 用户挫败感是一种衡量用户满意度的指标，它基于用户与系统交互时出现错误或不愉快情况的数量。这个指标可以帮助评估口语对话系统的交互质量，以及识别和理解组件的性能。 信息比特率是一种衡量系统响应速度和信息传输效率的指标。它基于每个查询中传输的平均信息量来计算。这个指标可以帮助评估口语对话系统在处理大量查询时的效率，并且可以用来比较不同系统之间的性能。 1. Introduction简介部分主要介绍了该论文的研究背景和目的，即评估口语对话系统，并提出了两个新的指标用于自动评估口语对话系统的话语和对话组件。同时，该部分还介绍了 GALAXY-II 架构中开发的工具，用于评估口语对话系统，并讨论了两个新指标。此外，该部分还强调了评估配置对于开发高质量、可靠的口语对话系统至关重要。 2. Galaxy-II ArchitectureGalaxy-II Architecture 主要介绍了 GALAXY-II 架构中开发的工具，用于评估口语对话系统。这些工具包括一个集中式中心枢纽和一组人类语言技术服务器，可以提供实现系统的有用工具，并简化这些系统评估的配置。其中，集中式中心枢纽是整个架构的核心，它负责协调各个服务器之间的通信和数据传输。而人类语言技术服务器则提供了各种自然语言处理功能，如语音识别、文本转换、对话管理等。 此外，该部分还介绍了 GALAXY-II 架构中开发的一组工具，用于评估口语对话系统。这些工具主要由一组 hub 程序组成，可以快速配置多种不同类型的服务器进行各种评估运行。其中包括两个专门设计用于增强评估能力的服务器。通过这些工具，研究人员可以更加方便地进行口语对话系统的评估和测试。 3. Programming Evaluation RunsProgramming Evaluation Runs 主要介绍了如何使用 GALAXY-II 架构中开发的工具来进行口语对话系统的评估。该部分指出，作者一直致力于开发和维护一种持续评估系统性能和组件级别的方法。而新的基于中心枢纽架构使得他们可以通过同一组控制所有其他系统功能的中心程序来简化评估过程，并且可以从任何其他组件服务器接收输入以进行评估。 在这个过程中，作者使用了一组 hub 程序来快速配置多种不同类型的服务器进行各种评估运行。这些服务器包括人类语言技术服务器、对话管理服务器、语音识别服务器等。通过这些工具，研究人员可以更加方便地进行口语对话系统的评估和测试。 为了进行这些类型的评估运行，作者开发了两个新的服务器：: a “batchmode” server and an “evaluation” server 3.1. Batchmode ServerBatchmode Server 是 GALAXY-II 架构中的一个服务器，其主要目的是通过离线方式处理用户查询。它可以从多种不同的输入源进行操作，包括正字法转录、N-best 列表、单词图、解析框架、波形文件，甚至是从以前的实时交互创建的系统日志文件。可以配置一个中心程序来使用任何上述输入之一或组合来生成日志文件。 3.2. Evaluation ServerEvaluation Server 是 GALAXY-II 架构中的一个服务器，其主要目的是进行比较和累积性能统计。它可以确定单 word error rate2 and concept error rate，其中后者基于理解用户查询的 E-form 表示。此外，Evaluation Server 还可以用于计算两个新指标：”user frustratio” and “information bit rate”，这些指标有助于评估对话和对话组件以及识别器和理解组件的性能。为了计算这些指标所需的表格数据存储在评估服务器中。 4. Automatic Methods for Understanding EvaluationAutomatic Methods for Understanding Evaluation 主要介绍了一种自动化的口语对话系统评估方法。该方法使用 E-form 评估度量，该度量比较通过解析原始正字法和通过解析选择的识别器假设获得的 E-form。作者还介绍了评估过程的历史和演变，并详细描述了评估服务器和其他工具的使用。 E-form 是一种表示用户查询的形式，它是通过将用户查询转换为一组语义标记来实现的。这些标记可以表示查询中的单词、短语和句子结构，以及它们之间的关系。E-form 可以用于评估口语对话系统的理解性能，因为它提供了一种标准化的方式来比较不同系统对相同查询的理解程度。在 GALAXY-II 架构中，E-form 是通过解析原始正字法或选择的识别器假设获得的。 5. Automatic Methods for Dialogue EvaluationAutomatic Methods for Dialogue Evaluation 首先讨论在重新处理记录数据时出现的一些问题，然后描述我们为对话评估设计的自动指标 5.1. Issues in Reprocessing DataIssues in Reprocessing Data 主要讨论了在重新处理数据时可能会遇到的问题。该章节指出，重新处理数据的主要目的是监测系统性能，以验证新版本系统是否运行良好。然而，在实际应用中，由于数据库查询系统提供的信息是动态的，因此重新处理数据变得困难。例如，当航班数据库发生变化时，基于收集时间可用航班的查询可能会变得不连贯。此外，用户经常询问即将到来的航班等未来事件，在稍后重新运行系统时这些事件已成为过去事件。最后，批处理运行的输出由于对话模型中的更改或识别和理解方面的改进而导致不连贯。 5.2. Proposed Evaluation MetricsProposed Evaluation Metrics 主要介绍了作者提出的两个新型评估指标，这些指标可以用于自动评估口语对话系统的性能。这些指标是： 用户挫败感：这个指标基于用户与系统交互时出现错误或不愉快情况的数量来衡量用户满意度。它可以帮助评估口语对话系统的交互质量，以及识别和理解组件的性能。 信息比特率：这个指标基于每个查询中传输的平均信息量来计算，用于衡量系统响应速度和信息传输效率。它可以帮助评估口语对话系统在处理大量查询时的效率，并且可以用来比较不同系统之间的性能。 为了计算这些指标，需要在提供用户查询正字法转录后重新处理日志文件。在计算过程中，原始正字法和识别器假设都会被逐句地运行，并且由识别器分支专门维护对话状态和对话状态。 6. Miscellaneous FeaturesMiscellaneous Features 主要介绍了 GALAXY-II 架构中的一些其他特性。这些特性包括： 更好的故障排除能力：GALAXY-II 架构中包括一些特性，可以帮助诊断和解决系统故障。例如，可以使用日志文件来跟踪系统行为，并且可以使用调试工具来检查系统状态。 灵活性：GALAXY-II 架构具有很高的灵活性，可以根据需要配置不同类型的服务器和组件。例如，可以使用不同类型的语音识别器、理解器和对话管理器来适应不同的应用场景。GALAXY-II 架构允许用户配置部分系统以便更好地关注某些组件。例如，用户可以只配置语音识别服务器和理解服务器，而不需要配置对话管理服务器。 7. Summary and Future WorkSummary and Future Work 是论文中的一个章节，主要总结了作者在使用 GALAXY-II 架构进行口语对话系统评估方面的工作，并提出了一些未来工作方向。 怎么这么难，完全看不懂，全靠 chatpdf 帮忙，又一次感受到自己的渺小。 读完一篇论文感觉都要死了,接下来只想摆烂了。 😇 😭","link":"/2023/03/08/Galaxy-II-as-an-Architecture-for-Spoken-Dialogue-Evaluation/"},{"title":"A Network-based End-to-End Trainable Task-oriented Dialogue System","text":"作者：Tsung-Hsien Wen, Milica Gašic, Nikola Mrkši ´ c, Lina M. Rojas-Barahona, ´Pei-Hao Su, Stefan Ultes, David Vandyke, Steve YoungAbstract摘要介绍了一种基于神经网络的端到端可训练对话系统，可以通过文本输入和输出进行训练。同时，还提出了一种新的收集面向任务对话数据的方法，基于一种新颖的 Wizard-of-Oz 框架。这种方法使我们能够轻松地开发对话系统，而不需要过多地假设所涉及的任务。结果表明，在餐厅搜索领域，该模型可以与人类主体自然交谈，并帮助他们完成任务。 1. Introduction这篇论文的简介部分介绍了当前开发任务导向对话系统所面临的挑战，以及现有方法所存在的问题。通常情况下，开发这种对话系统需要创建多个组件，并且通常需要大量手工制作或获取标记数据集并为每个组件解决统计学习问题。本文提出了一种新的方法，即基于神经网络的端到端可训练对话系统，可以通过文本输入和输出进行训练，并且使用一种新颖的 Wizard-of-Oz 框架收集面向任务对话数据。该方法使我们能够轻松地开发对话系统，而不需要过多地假设所涉及的任务。 2. Model模型将对话是为一个序列到序列的映射问题（以一个序列到序列的架构为模型），并添加了对话历史（以一个信念追踪为模型），如图所示。每个循环中，系统把来自用户的序列块当做输入，然后把它转换到两个内部组件中：一个由意图网络生成的分布式组件和一个在由一系列信念追踪器生成的信念状态组成的槽值对上的概率分布。然后数据库操作器在信念状态中选择最可能的值来形成一个面向 DB 的查询语句，然后就是查询结果，随后意图组件和信念状态被策略网络转化组合成一个单向量来表示下一个系统动作。然后使用该系统动作向量对响应生成所需的系统输出令牌。最后系统响应是通过用数据库词目的真实值来替换骨架句子结构来生成的。 2.1 Intent Network意图网络是该论文模型的中间层之一，用于将用户输入的自然语言序列编码为分布式向量表示。它可以被视为序列到序列学习框架中的编码器，其工作是在每个时间步骤 t 将输入令牌序列 wt0，wt1，…，wtN 编码为分布式向量表示 zt。通常使用长短时记忆（LSTM）网络作为意图网络，并将最后一个时间步骤的隐藏层 zNt 作为表示。此外，也可以使用卷积神经网络（CNN）来代替 LSTM 来编码句子。 2.2 Belief Trackers这个部分又被称作是 Dialogue State Tracking (DST)，是 task-oriented spoken dialogue system 的核心部件。 这个组件的输入时用户的输入，输出是一个 informable slot 和 requestable slot 的概率分布，这里的 informable slot 是指 food type，price range（以订餐为例），用来约束数据库中的查询，requestable slot 是指 address，phone，postcode 等一些可以被询问的值。这里会定义一个针对具体任务的知识图谱，来表示这些 slot 之间的关系，每个 slot 都会定义一个 tracker，tracker 的模型如图所示，包括一个 CNN 特征提取模块和一个 Jordan 型的 RNN 模块 (recurrence from output to hidden layer)，CNN 不仅仅对当前的输入进行处理，还对上一轮的机器响应进行处理，综合起来作为 RNN 的输入。 2.3 Database Operator数据库查询的输入来自于 Belief Trackers 的输出，即各种 slot 的概率分布，取最大的那个作为数据库的输入，进行查询，获取到相应的值。 2.4 Policy Network这个组件是像一个胶水，起到粘合其他上面三个组件的作用。输入是上面三个组件的输出，输出是一个代表系统动作的向量。 2.5 Generation Network这一模块本质上是一个语言模型，在 Policy Network 的输出的系统动作下，生成相应的响应，再经过一些处理返回给用户。这里的处理主要是将响应中的 slot，比如 s.food 还原成真实的值。生成部分用简单的 LSTM-LM 可以做，用 Attention Generation Model 也可以做，效果会更好。 3. Wizard-of-Oz Data CollectionWizard-of-Oz 数据收集是该论文提出的一种用于收集特定领域对话数据的方法。在该方法中，人类操作员扮演对话系统，与用户进行交互，并记录用户的输入和系统响应。这种方法可以用于收集特定领域的任务导向对话数据，以便训练和评估任务导向对话系统。 4. Empirical ExperimentsTraining作者通过两个阶段的训练过程来训练提出的模型。第一阶段是训练 Belief Tracker 参数 θb，使用交叉熵误差计算跟踪器标签 yts 和预测 pts 之间的误差。第二阶段是使用强化学习方法训练策略网络和值函数网络，并将 Belief Tracker 作为输入馈送到策略网络中。 评估摆烂了，直接上链接 https://arxiv.org/pdf/1604.04562.pdf 5. Conclusions and Future Work作者指出，他们提出的模型在 Wizard-of-Oz 数据集上取得了很好的性能，但仍存在一些局限性。例如，该模型只能处理文本输入，无法直接处理嘈杂的语音识别输入，并且无法在不确定时询问用户进行确认。此外，该模型还需要更多的实验来验证其在更大和更广泛领域中的可扩展性。 论文里的数学公式完全看不懂，不关注细节，只看懂了大概，我大抵是个废物罢 😭 上周烦心事比较多，没更新 blog。这周总算能静下心来好好学一会了，缓解焦虑最好的办法确实是学习一些自己感兴趣的东西，总之看完这篇论文，心里确实好受一点了。 希望这周能再看一篇论文 chatpdf 确实好用，可惜收费了 😇 最后附上一篇知乎 weizier 大佬的文章：NLP 的巨人肩膀","link":"/2023/03/20/A-Network-based-End-to-End-Trainable-Task-oriented-Dialogue-System/"},{"title":"POMDP-based Statistical Spoken Dialogue Systems: a Review","text":"作者：Steve Young, Fellow, IEEE, Milica Gasiˇ c,´ Member, IEEE, Blaise Thomson, Member, IEEE,and Jason D Williams, Member, IEEEAbstract统计对话管理系统是一种数据驱动的方法，无需人工构建对话管理机制，具有较好的鲁棒性。部分可观察的马尔可夫决策过程（POMDPs）具有良好的数据驱动性，但问题是完整的建模和优化计算代价巨大，甚至不可实现。在实际过程中，需对 POMDP-based 的系统近似优化求解，以下内容将对 POMDP-based 的系统的领域现状做一个综合介绍。 1. Introduction传统的 SDS 的主要组成部分如下图所示。口语理解模块（SLU）将语言转换成抽象语义表示，即用户对话行为 𝑢𝑡，而后系统更新其内部状态 𝑠𝑡，然后系统通过决策规则 𝑎𝑡 = 𝜋(𝑠𝑡)确定系统行为，最后语言生成模块（NLG）将系统行为 𝑎𝑡 转化为自然语言字符串。其中，状态变量 𝑠𝑡 包含跟踪对话过程的变量，以及表示用户需求的属性值（又称为 slots）。在传统对话系统中，决策规则是通过流程图的方式实现的，图中的结点表示状态和行为，而边则表示用户输入。 新型的对话管理系统基于部分可观察的马尔可夫决策过程（POMDPs），该方法假定对话过程是马尔可夫决策过程，也就是说，对话初始状态是 𝑠0, 每一个后续状态用转移概率来表示：𝑝(𝑠𝑡 |𝑠𝑡−1, 𝑎𝑡−1)。状态变量 𝑠𝑡 是无法直接观察到的，它代表了对用户需求理解的不确定程度。系统把 SLU 的输出看作是一个带噪音的基于用户输入的观察值，这个观察值的概率为 𝑝(𝑜𝑡 |𝑠𝑡)，这里的转移概率和生成概率用恰当的随机统计模型表示，又称为对话模型 M，而每个步骤中采取哪个行动则由另一个随机模型控制，该模型称之为对话策略 P。 在对话过程中，每一步还需要一个回报函数来体现理想中的对话系统特性。对话模型 M 和对话策略 P 的优化是通过最大化回报函数的期望来实现的，该过程可以通过直接用户交互在线训练，也可以利用离线的语料库训练。详见下图。 然而在实践中运用 POMDP 并不容易，有许多实际问题需要解决。SDS 的状态行为空间巨大，求解这个空间需要复杂的算法和软件。实时的贝叶斯推理也非常难，完整的 POMDP 的学习策略是不可实现的，因此必须利用近似法求解。优化基于 POMDP 的 SDS 的最直接方式是通过直接用户对话。但是，通常难以找到足够数量的用户帮助训练系统，所以实践中常常通过用户模仿器的方式来对参数模型进行优化。 2. PARTIALLY OBSERVABLE MARKOV DECISION PROCESSES部分可观察的马尔可夫决策过程用一个多元组（S, A, T, R, O, Z, 𝛾, 𝑏0）表示，其中 S 是状态集；A 是行为集合；T 表示转移概率 𝑃(𝑠𝑡 |𝑠𝑡−1, 𝑎𝑡−1); R 是回报的期望值；O 是观测值集合；Z 代表观测概率 𝑃(𝑜𝑡 |𝑠𝑡 , 𝑎𝑡−1 ); 𝛾 是几何衰减系数，其值在 0-1 之间；𝑏0 是置信状态的初始值。 POMDP 的过程如下：在每一个过程中，真实世界是一个无法观察的状态 𝑠𝑡。因为 𝑠𝑡 是未知的，变量置信状态 𝑏𝑡 表示所有可能状态的分布，𝑏𝑡(𝑠𝑡)表示处在某个特定状态 𝑠𝑡 的概率。系统基于 𝑏𝑡 选择行为 𝑎𝑡，得到一个激励值 𝑟𝑡，然后转化到状态 𝑠𝑡+1，这里 𝑠𝑡+1 仅仅依赖于 𝑠𝑡 和 𝑎𝑡。然后系统得到一个观察值 𝑜𝑡+1，该值依赖于 𝑠𝑡+1 和 𝑎𝑡。这个过程如图所示 但问题是通用的 POMDP 方法复杂度高，难以大规模的应用到实用对话系统。即使中小型规模，其涉及的状态、行为、和观察值很容易达到 1010 量级。穷举 𝑃(𝑠𝑡+1|𝑠𝑡 , 𝑎𝑡)是不可实现的，因此，直接优化更新置信状态优化回报函数并不可行。通常情况下，我们需要简化模型近似求解。接下来我们将详细讨论。 3. BELIEF STATE REPRESENTATION AND MONITORING本小节集中讨论图 2 中对话系统模型 M。实用 SDS 中，状态必须包含三种不同类型的信息：用户的目标 𝑔𝑡 , 用户的真实意图 𝑢𝑡，以及对话历史 ℎ𝑡。用户目标包含需要完成任务所有信息，用户真实意图是指用户实际想表达的意图而非系统识别出的意图，对话历史跟踪之前的对话流。由此，对话中的一个状态包含三个因子：st = (gt, ut, ht) 引入条件独立性假设以后，该过程可以表示为下图。将状态分解成以上三个因子可以对状态转移矩阵进行降维，同时也减少了系统的条件依赖性。 虽然状态因子模型极大的简化了 POMDP 模型的复杂度，但是它仍旧复杂，难以在实际的系统中应用。因此还需要进一步近似化处理，通常有两种常用技术： N-best 方法，包括剪枝和重组 贝叶斯网络法 4. POLICY REPRESENTATION AND REINFORCEMENT LEARNING策略模型 P 提供了置信状态 b 和系统行为 a 的映射。我们的目标是寻找一个最优的策略最大化对话回报函数的综合期望。 有五种常用的方法来优化策略： planning under uncertainty value iteration Monte-Carlo 优化 最小平方策略迭代（LSPI） natural actor-critic （NAC）. 这五种方式常常应用在 end-to-end 的对话系统中。除此之外，还有 Q-learning 和 SARSA 等方法。 没看懂，摆烂了 5. USER SIMULATORS直接从语料库中学习对话策略存在很多问题，比如收集数据中的状态空间可能与策略优化数据不同。另外，这种方式无法在线互动学习。因此我们可以构建一个用户模拟器，让这个模拟器与对话系统直接进行互动。用户模拟器不仅仅可以用来学习对话系统，也可以用它来评估对话系统。 6. DIALOGUE MODEL PARAMETER OPTIMISATION在 POMDP 中，对话系统的完整模型由两组参数组成：具有参数 τ 的对话模型 M，其中包括用户、观察和转移概率分布；以及具有参数 θ 的策略模型 P。大多数当前的 POMDP 开发都集中在策略优化和 θ 参数上，而对话模型和 τ 参数则经常是手工制作的。虽然手工制作对话模型可能看起来不太令人满意，但在许多情况下，对话设计师将对参数应该在哪里具有强烈先验知识。例如，在许多应用程序中，假定用户目标在整个对话过程中保持不变是合理的。 因此，在 POMDP 中，需要优化两组参数：对话模型 M 中的 τ 参数和策略模型 P 中的 θ 参数。尽管大多数研究都集中在策略优化上，但手工制作对话模型仍然是一种常见且有效的方法，并且可以根据应用程序和领域特定知识进行调整。 7. FAST TRAINING AND USER ADAPTATION在 POMDP 中，对于一个真实世界的口语对话系统，策略优化需要进行 O(10^5)个训练对话，这个数量太大了，无法直接与人类用户进行交互。因此，目前的策略优化依赖于与用户模拟器的交互。这些模拟器需要高度复杂，并且不容易构建。此外，使用模拟用户训练出来的策略会偏向于这些模型所包含的特定行为。 因此，在 POMDP 中，快速训练和用户适应是非常重要的问题。目前有一些方法可以加速策略优化过程，并且可以通过在线学习算法来实现与真实用户的交互。例如，在线学习算法可以使用增量式方法来更新策略，并根据代理与真实用户交互时获得的奖励信号进行调整。 8. SYSTEMS AND APPLICATIONS前面的几个小节讲述了统计对话系统的几个主要模块，其相关的技术在随着时间进步完善。尽管在商业上推广这些技术有一定的难度，但是在具体的场景中已有一定范围应用。这里我们简单的提几个基于 POMDP 框架的对话系统。 这些系统大多都是非正式的 inquiry 系统，包括语音呼叫（Janarthanam et al., 2011），旅游信息（Thomson &amp; Yong, 2010），日程安排（Kim &amp; Lee, 2007）和汽车导航（Kim et al., 2008）等。POMDP 也可应用于基于命令控制的系统，如通过多模接口控制家电（Williams, 2007）。 POMDP 曾在 CMU 举办的“Let’s Go”竞赛任务中被应用，其为 Pittsburgh 区域的居民播报非忙时段的公交车信息（Thomson et al., 2010）。在该应用中，用户可能从多种不同的手机装置来电，且通话环境通常有噪音，结果显示，基于 POMDP 的系统明显优于传统系统（Black et al., 2011）。 没啥用，搬一下原文 9. EVALUATION AND PERFORMANCE在语音和自然语言处理领域，大多数数据驱动任务的评估方法都已经建立。但是，对于口语对话系统的评估需要与用户进行交互，因此比较困难。 目前，有几种方法可以评估口语对话系统的性能。其中一种方法是使用人类评估员来评估系统的性能，并根据其反馈来调整系统。另一种方法是使用自动评估指标来衡量系统的性能，例如识别准确率、理解准确率、策略成功率等。 10. HISTORICAL PERSPECTIVE在口语对话系统中使用 POMDP 的第一篇论文可以追溯到 2000 年的 Roy 等人和 2001 年的 Zhang 等人。然而，在此之前，一些关键思想已经被探索。将对话管理视为可观察马尔可夫决策过程（MDP）并通过强化学习优化策略的想法归功于 Levin 和 Pieraccini。其他人很快就对这项工作进行了开发。然而，在明显缺乏任何明确表示不确定性或不完整信息的显式模型时使用 MDP 方法失去了动力。 搬原文 11. CONCLUSIONS本文对对话系统的领域研究现状做了一个整体介绍。对话系统的核心问题是处理多轮交互，让人机之间的互动高效、自然、智能。在本文中我们涉及了对话系统的主要任务模块，并做了简单的概述，同时指出了对话系统所面临的问题和挑战。我们还介绍了对话系统的演进历史及其应用实例，并从口语交流、多模交互和对话管理方面介绍了该领域的研究趋势。接下来，本文详细介绍了 POMDP 统计对话管理器的相关技术及领域现状，同时也指出了其中的问题及面临的挑战。 总算读完了，虽然很多东西都没看懂，但还是学到了一些东西的。以后还是得好好看看数学公式。 勉强完成目标，再接再厉。 附上一些参考资料：111 再附上一个知乎大佬 heaven 的强化学习专栏：强化学习轻松入门","link":"/2023/03/26/POMDP-based-Statistical-Spoken-Dialogue-Systems-a-Review/"}],"tags":[{"name":"test","slug":"test","link":"/tags/test/"},{"name":"paper","slug":"paper","link":"/tags/paper/"},{"name":"NLP","slug":"NLP","link":"/tags/NLP/"}],"categories":[]}